Repository: robot-xliff-farmer/mapsapi-examples
Catalog: mapsapi-examples.tmx
Source language: ru
Languages: en

source: Функция, которая определяет сам модуль. Первым аргументом идет provide-функция. В provide-функцию нужно будет передать непосредственно модуль. Вызов provide-функции может быть отложен во времени. К примеру, для загрузки каких-либо данных. Последующие аргументы - это запрошенные в зависимостях модули.
en: The function that defines the module itself. The first argument is the provide function. The provide function must be passed directly to the module. The provide function call may be delayed. For example, in order to load some data. Subsequent arguments are requested in the module dependencies.

source: Создаем второй собственный модуль. Этот модуль предоставляет собственный элемент управления, который создается на основе кнопки.
en: Creating a second custom module. This module provides its own control, which is based on the buttons.

source: Второй модуль в зависимостях запрашивает первый.
en: The second module in the dependencies requests the first one.

source: Наследуем все методы стандартной кнопки.
en: Inheriting all the methods of a standard button.

source: Переопределяем метод setParent.
en: Overriding the setParent method.

source: Инициализация карты.
en: Map initialization.

source: Запрашиваем в модульной системе собственный контрол.
en: Requesting our custom control in the module system.

source: Создаем экземпляр собственной кнопки и добавляем её на карту.
en: Creating an instance of your custom button and adding it to the map.

source: Создаем кнопку, при помощи которой добавляем метки на карту.
en: Creating a button that we use for adding placemarks to the map.

source: Добавление метки по клику в случайное место.
en: Adding a placemark by clicking randomly.

source: Для ломаных доступен визуальный редактор. Ссылка на редактор содержится в поле editor объекта-ломаной.
en: A visual editor is available for polylines. A link to the editor is in the editor field of the polyline object.

source: Создаем ломаную.
en: Creating a polyline.

source: Указываем координаты вершин.
en: Specifying the coordinates of the vertices.

source: Задаем опции геообъекта. Цвет с прозрачностью.
en: Setting geo object options. Color with transparency.

source: Ширину линии.
en: The line width.

source: Максимально допустимое количество вершин в ломаной.
en: The maximum number of vertices in the polyline.

source: Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
en: Adding a new item to the context menu that allows deleting the polyline.

source: Добавляем линию на карту.
en: Adding a line to the map.

source: Включаем режим редактирования.
en: Turning on the edit mode.

source: Примеры. Редактор ломаной
en: Examples. Polyline editor

source: Примеры. Добавление кнопки "Геолокация"
en: Examples. Adding the "Geolocation" button

source: Хинт может быть расположен вне контейнера карты и отображаться поверх других элементов на странице (поведение по умолчанию) или же всегда находиться внутри карты. За это отвечает опция `pane`.
en: A hint can be located outside the map container and displayed on top of other elements on the page (this is the default value). Alternatively, it can always stay inside the map. This is controlled by the 'pane' option.

source: С помощью другой опции — `fitPane` (`true` по умолчанию) — можно заставить хинт сдвигаться таким образом, чтобы всегда полностью отображаться в видимой части своего контейнера, не пересекая его границы и не вызывая появление полос прокрутки.
en: Using a different option, 'fitPane' ('true' by default), you can forcer the hint to move so that it is always displayed completely within the visible area of its container, without touching its boundaries and not causing the scrollbar to appear.

source: Примеры. Опции разамещения хинта.
en: Examples. Hint placement options.

source: Примеры. Добавление отдельных элементов управления
en: Examples. Adding individual controls

source: На карте можно отобразить балун и хинт.
en: On the map you can display the balloon and hint.

source: Ссылки на менеджеры балуна и хинта содержатся в полях balloon и hint объекта карты. Менеджеры реализованы в виде классов [#$dp13] и [#$dp14], но создавать экземпляры этих классов самостоятельно не следует — используйте соответствующие поля объекта карты.
en: References to the balloon and hint managers are contained in the balloon and hint fields of the map object. Managers are implemented as [#$dp13] and [#$dp14], but you should not create instances of these classes — use the corresponding fields of the map object.

source: Доступ к балуну и хинту имеют геообъекты, активные области и другие сущности на карте. C помощью соответствующих свойств и опций (префиксы balloon и hint) можно описать балун и хинт геообъекта/активной области. При этом координаты балуна и хинта будут вычисляться автоматически.
en: The geo objects, hotspots , and other entities on the map have access to the balloon and hint. Use the corresponding properties and options (the balloon and hint) prefixes) to describe the balloon and hint of a geo object/hotspot. The coordinates of the balloon and the hint will be calculated automatically.

source: Чтобы балун и хинт открывались на метке, необходимо задать ей определенные свойства.
en: In order for the balloon and hint to open on the placemark, you need to set certain properties.

source: Открываем балун на карте (без привязки к геообъекту).
en: Opening the balloon on the map (without binding to the geo object).

source: Опция: не показываем кнопку закрытия.
en: Option: do not show the close button.

source: Показываем хинт на карте (без привязки к геообъекту).
en: Showing the hint on the map (without binding to the geo object).

source: Опция: задержка перед открытием.
en: Option: delay before opening.

source: Примеры. Балун и хинт
en: Examples. Balloon and hint

source: Примеры YMapsML. Изменение шаблона содержимого балуна.
en: YMapsML examples. Changing the balloon content template.

source: Событие карты представляет собой объект класса [#$dp8]. Извлечение данных из этого объекта производится с помощью метода get.
en: The map event is an object of the [#$dp8] class. Extracting data from this object is done using the get method.

source: В данном примере из объекта-события извлекаются координаты точки щелчка левой кнопки мыши.
en: In this example, the coordinates of the point clicked with the left mouse button are extracted from the event object.

source: Обработка события, возникающего при щелчке левой кнопкой мыши в любой точке карты. При возникновении такого события откроем балун.
en: Processing events that occur when the user left-clicks anywhere on the map. When such an event occurs, we open the balloon.

source: Обработка события, возникающего при щелчке правой кнопки мыши в любой точке карты. При возникновении такого события покажем всплывающую подсказку в точке щелчка.
en: Processing events that occur when the user right-clicks anywhere on the map. When such an event occurs, we display a popup hint at the point of click.

source: Скрываем хинт при открытии балуна.
en: Hiding the hint when opening the balloon.

source: Примеры. Координаты щелчка
en: Examples. Click coordinates

source: Результаты поиска будем помещать в коллекцию.
en: The search results will be placed in the collection.

source: При клике по найденному объекту метка становится красной.
en: When the found object is clicked, the placemark turns red.

source: Выбранный результат помещаем в коллекцию.
en: Putting the selected result in the collection.

source: Примеры. Задание собственного отображения для результатов поиска
en: Examples. Setting a custom display for search results

source: С помощью объекта [#$dp9] можно создавать объекты на карте из их JSON-описания.
en: Using the [#$dp9] object, you can create objects on the map from their JSON description.

source: В данном примере рассматривается, как найти объекты выборки, ближайшие к произвольному объекту на карте (например к метро). А также как находить объекты, ближайшие к месту клика.
en: This example explains how to find objects in the selection that are nearest to an arbitrary object on the map (such as the metro). It also shows how to find the objects that are closest to the click.

source: Найдем в выборке кафе, ближайшее к найденной станции метро, и откроем его балун.
en: Searching the selection for the cafe nearest to the found metro station, and opening its balloon.

source: Будем открывать балун кафе, который ближе всего к месту клика
en: Opening the balloon of the cafe that is closest to the click.

source: Описания кафе можно хранить в формате JSON, а потом генерировать из описания геообъекты с помощью ymaps.geoQuery.
en: Cafe descriptions can be stored in JSON format, in order to then generate geo objects from the descriptions using ymaps.geoQuery.

source: Сразу добавим точки на карту.
en: Adding points to the map immediately.

source: С помощью обратного геокодирования найдем метро "Кропоткинская".
en: Using reverse geocoding to find the metro station "Kropotkinskaya".

source: Нужно дождаться ответа от сервера и только потом обрабатывать полученные результаты.
en: Waiting for the response from the server and then processing the received results.

source: Примеры. Поиск ближайшего объекта.
en: Examples. Searching for the nearest object.

source: При клике на карту будет открываться балун ближайшей к месту клика метки
en: When the map is clicked, the balloon opens for the placemark nearest to the click

source: Тип промежуточных точек, которые могут быть добавлены при редактировании.
en: A type of intermediate points that can be added when editing.

source: В режиме добавления новых путевых точек запрещаем ставить точки поверх объектов карты.
en: In the mode for adding new waypoints, we do not allow putting points on top of the map objects.

source: Включение режима редактирования. В качестве опций может быть передан объект с полями: addWayPoints - разрешает добавление новых путевых точек при клике на карту. Значение по умолчанию: false. dragWayPoints - разрешает перетаскивание уже существующих путевых точек. Значение по умолчанию: true. removeWayPoints - разрешает удаление путевых точек при двойном клике по ним. Значение по умолчанию: false. dragViaPoints - разрешает перетаскивание уже существующих транзитных точек. Значение по умолчанию: true. removeViaPoints - разрешает удаление транзитных точек при двойном клике по ним. Значение по умолчанию: true. addMidPoints - разрешает добавление промежуточных транзитных или путевых точек посредством перетаскивания маркера, появляющегося при наведении курсора мыши на активный маршрут. Тип добавляемых точек задается опцией midPointsType. Значение по умолчанию: true
en: Enabling edit mode. As options, you can pass an object with fields: addWayPoints - Allows adding new waypoints by clicking on the map. Default value: false. dragWayPoints - Allows dragging existing waypoints. Default value: true. removeWayPoints - Allows deleting waypoints by double-clicking them. Default value: false. dragViaPoints - Allows dragging existing throughpoints. Default value: true. removeViaPoints - Allows deleting throughpoints by double-clicking them. Default value: true. addMidPoints - Allows adding intermediate points or waypoints by dragging the marker that appears when pointing the mouse at the active route. The type of points to add is set by the midPointsType option. Default value: true.

source: Выключение режима редактирования.
en: Turning off edit mode.

source: Создаем карту с добавленной на нее кнопкой.
en: Creating the map with the button added to it.

source: Добавляем мультимаршрут на карту.
en: Adding a multiroute to the map.

source: Примеры. Редактирование мультимаршрута
en: Examples. Editing a multiroute

source: Создадим провайдер пробок "Сейчас" с включенным слоем инфоточек.
en: Creating a "Now" traffic provider with the layer of information points enabled.

source: И затем добавим его на карту.
en: And then adding it to the map.

source: Удаление провайдера с карты также производится через метод setMap. actualProvider.setMap(null);
en: Removing the provider from the map is also performed through setMap. actualProvider.setMap(null);

source: Примеры. Слой пробок на карте без добавления кнопки
en: Examples. Traffic layer on the map without buttons added

source: Примеры. Собственный макет балуна мультимаршрута
en: Examples. Custom layout for the multiroute balloon

source: Создание собственного макета с помощью фабрики макетов.
en: Creating your own layout using the layout factory.

source: Отключаем режим панели для балуна.
en: Disabling the panel mode for the balloon.

source: Примеры. Пользовательский макет кнопки.
en: Examples. Custom layout for a button.

source: Макет кнопки должен отображать поле data.content и изменяться в зависимости от того, нажата кнопка или нет.
en: The button layout should display the data.content field and change depending on whether the button is pressed or not.

source: [#$dp7] - класс, позволяющий добавить на карту большое количество точечных объектов без необходимости создавать и добавлять на карту метки по отдельности.
en: [#$dp7] - class that allows you to add a large number of point objects without having to create separate placemarks and add them to the map.

source: [#$dp14] принимает описания меток в JSON формате. Метки могут кластеризоваться или показываться как есть. Если вы не используете кластеризацию, то метки будут показаны только в видимой области карты. Поскольку объекты хранятся в менеджере в виде JSON описаний и их визуальное отображение создается только по необходимости, этот способ добавления точек на карту работает быстрее, чем добавление меток на карту напрямую или через кластеризатор.
en: [#$dp14] accepts placemark descriptions in JSON format. Placemarks can be clustered or displayed as-is. If you are not using clustering, the placemarks will be shown only in the visible area of the map. Because objects are stored in the manager in the form of JSON descriptions and their visual representation is created only when needed, this method of adding points to the map works faster than adding placemarks to the map directly or through clusterization.

source: ObjectManager принимает те же опции, что и кластеризатор.
en: ObjectManager accepts the same options as the clusterer.

source: Чтобы задать опции одиночным объектам и кластерам, обратимся к дочерним коллекциям ObjectManager.
en: To set options for single objects and clusters, we refer to child collections of ObjectManager.

source: Примеры. Добавление на карту большо числа объектов
en: Examples. Adding a large number of objects to the map

source: Пример иллюстрирует, как добавлять результаты геокодирования в выборку [#$dp9]. С помощью метода applyBoundsToMap можно устанавливать область картографирования так, чтобы в нее попадали все объекты выборки. С помощью метода clusterize объекты можно добавлять в кластеризатор.
en: The example illustrates how to add geocoding results to the [#$dp9] selection. Using the applyBoundsToMap method, you can set the mapping area so that all the objects in the selection fall into it. Use the clusterize method to add objects to the clusterer.

source: Сделаем запрос на геокодирование, а затем спозиционируем карту, чтобы все объекты попадали в видимую область карты и коэффициент масштабирования был максимально возможным.
en: Making a geocoding request, then positioning the map so that all objects fall within the map viewport and the zoom level is as high as possible.

source: Откластеризуем полученные объекты и добавим кластеризатор на карту. Обратите внимание, что кластеризатор будет создан сразу, а объекты добавлены в него только после того, как будет получен ответ от сервера.
en: Clustering the resulting objects and adding the clusterer to the map. Note that the clusterer is created immediately, but the objects are added to it only after the response is received from the server.

source: Примеры. Позиционирование карты для показа результатов геокодирования и их кластеризация.
en: Examples. Positioning the map to display geocoding results and clustering

source: Показаны кластеризованные результаты по запросу "Арбат"
en: Clustered results for the request "Arbat" are shown

source: Добавим на карту схему проезда от улицы Крылатские холмы до станции метро "Кунцевская" через станцию "Молодежная" и затем до станции "Пионерская". Точки маршрута можно задавать 3 способами: как строка, как объект или как массив геокоординат.
en: Adding driving directions to the map from Krylatsky Hills street to the metro station "Kuntsevskaya" via the station "Molodezhnaya" and then to the metro station "Pionerskaya". Route points can be set in 3 ways: as a string, as an object, or as an array of geocoordinates.

source: метро "Молодежная" - транзитная точка (проезжать через эту точку, но не останавливаться в ней).
en: Metro "Molodezhnaya" is a through point (passing through this point, but not stopping at it).

source: Зададим содержание иконок начальной и конечной точкам маршрута. С помощью метода getWayPoints() получаем массив точек маршрута. Массив транзитных точек маршрута можно получить с помощью метода getViaPoints.
en: Setting the contents of the icons for the start and end points of the route. Using the getWayPoints() method to get an array of waypoints. The getViaPoints method can be used for getting the route's through points.

source: Задаем стиль метки - иконки будут красного цвета, и их изображения будут растягиваться под контент.
en: Setting the placemark style - icons will be red, and their images will stretch to fit the content.

source: Задаем контент меток в начальной и конечной точках.
en: Setting the placemark content in the start and end points.

source: Проанализируем маршрут по сегментам. Сегмент - участок маршрута, который нужно проехать до следующего изменения направления движения. Для того, чтобы получить сегменты маршрута, сначала необходимо получить отдельно каждый путь маршрута. Весь маршрут делится на два пути: 1) от улицы Крылатские холмы до станции "Кунцевская"; 2) от станции "Кунцевская" до "Пионерская".
en: Analyzing the route by segments. A segment is a section of the route up to the next change of direction. In order to obtain the route segments, you first need to obtain each path of the route separately. The entire route is divided into two paths: 1) from Krylatsky Hills street to the station "Kuntsevskaya"; 2) from "Kuntsevskaya" station to "Pionerskaya".

source: Получаем массив путей.
en: Getting an array of paths.

source: Выводим маршрутный лист.
en: Outputting the route form.

source: Примеры. Построение маршрута
en: Examples. Route planning

source: Поиск объекта его названию реализуется с помощью функции [#$dp12]. Однако, эта функция производит поиск среди объектов, размещенных на обычной или народной карте.
en: Searching for an object by name is implemented using the [#$dp12] function. However, this function searches among the objects placed on the regular or public map.

source: А что делать, если необходимо организовать поиск по собственным объектам и интегрировать его с API Яндекс.Карт? Написать собственный провайдер поиска, который можно использовать в функции [#$dp15] и элементе управления Поиск по карте.
en: What if you want to organize the search across custom objects and integrate it with the Yandex.Maps API? Write your own search provider, which can be used in the [#$dp15] function and the "Search on map" control.

source: Провайдер поиска должен реализовывать интерфейс [#$dp19]. Данный пример показывает, как написать собственный провайдер и подключить его стандартному элементу управления Поиск по карте.
en: The search provider must implement the [#$dp19] interface. This example shows how to write your own provider and connect it to the standard "Search on map" control.

source: Обсуждение этого примера можно посмотреть в клубе.
en: The example is discussed in more detail in the club.

source: Создаем коллекцию.
en: Creating a collection.

source: Создаем массив с данными.
en: Creating an array with the data.

source: Добавляем контрол в верхний правый угол,
en: Adding the control in the upper right corner,

source: Провайдер данных для элемента управления ymaps.control.SearchControl. Осуществляет поиск геообъектов в по массиву points. Реализует интерфейс IGeocodeProvider.
en: The data provider for ymaps.control.SearchControl. Performs a search for geo objects in the "points" array. Implements the IGeocodeProvider interface.

source: Ищем в свойстве text каждого элемента массива.
en: Searching in the "text" property of each item in the array.

source: Примеры. Поиск по своим объектам
en: Examples. Searching across your own objects

source: Каждому географическому объекту в YMapsML ставятся в соответствие геометрическая фигура и геообъект, используемый для отображения этой фигуры на карте. Описание фигур и их привязка к географическим координатам задается в соответствующих YMapsML-элементах. Для фигуры "замкнутая линия" предназначен элемент gml:LinearRing. Он содержит координаты вершин линии. Координаты первой и последней вершин должны совпадать.
en: In YMapsML, each geographical object is associated with a geometric shape and a geo object that is used for displaying this shape on the map. The shape definitions and their anchors to geographical coordinates are set in corresponding YMapsML elements. The gml:LinearRing element is designated for the "linear ring" shape. This element contains the coordinates of line endpoints. The coordinates of the first and last endpoints must match.

source: Для загрузки YMapsML-данных предназначена функция [#$dp18]. После того как данные загрузятся, функция преобразует их в [#$dp19] и передает в качестве параметра функции-обработчику. Коллекцию геообъектов GeoObjectCollection можно отобразить на карте.
en: The [#$dp18] function is for loading YMapsML data. After data has loaded, the function converts the data to [#$dp19] and passes it to the handler function as a parameter. A GeoObjectCollection can be displayed on the map.

source: Примеры YMapsML. Ломаная.
en: YMapsML examples. Polyline.

source: Создание экземпляра карты.
en: Creating an instance of the map.

source: Загрузка YMapsML-файла.
en: Loading a YMapsML file.

source: Добавление геообъектов на карту.
en: Adding geo objects to the map.

source: Вызывается в случае неудачной загрузки YMapsML-файла.
en: Called if loading the YMapsML file was unsuccessful.
